; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=210, out_folder=./training, instance_id=30, seed=2054, goal_proportion=0.03

(define (problem blocksworld-30)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 - object)
 (:init 
    (arm-empty)
    (clear b120)
    (on b120 b36)
    (on b36 b48)
    (on b48 b110)
    (on b110 b82)
    (on b82 b83)
    (on b83 b135)
    (on b135 b52)
    (on-table b52)
    (clear b168)
    (on b168 b1)
    (on b1 b86)
    (on-table b86)
    (clear b157)
    (on b157 b116)
    (on-table b116)
    (clear b24)
    (on b24 b105)
    (on b105 b94)
    (on b94 b71)
    (on-table b71)
    (clear b117)
    (on-table b117)
    (clear b92)
    (on b92 b164)
    (on b164 b126)
    (on-table b126)
    (clear b72)
    (on b72 b8)
    (on b8 b67)
    (on b67 b204)
    (on b204 b28)
    (on b28 b145)
    (on b145 b102)
    (on-table b102)
    (clear b182)
    (on-table b182)
    (clear b132)
    (on b132 b186)
    (on b186 b158)
    (on-table b158)
    (clear b161)
    (on b161 b179)
    (on-table b179)
    (clear b184)
    (on-table b184)
    (clear b107)
    (on b107 b203)
    (on-table b203)
    (clear b191)
    (on b191 b100)
    (on-table b100)
    (clear b53)
    (on-table b53)
    (clear b50)
    (on b50 b78)
    (on b78 b180)
    (on b180 b41)
    (on b41 b51)
    (on b51 b195)
    (on b195 b3)
    (on b3 b10)
    (on b10 b81)
    (on b81 b127)
    (on b127 b76)
    (on b76 b37)
    (on b37 b178)
    (on-table b178)
    (clear b208)
    (on b208 b25)
    (on b25 b31)
    (on b31 b43)
    (on-table b43)
    (clear b210)
    (on b210 b119)
    (on b119 b69)
    (on-table b69)
    (clear b121)
    (on b121 b21)
    (on b21 b192)
    (on-table b192)
    (clear b197)
    (on b197 b201)
    (on-table b201)
    (clear b101)
    (on b101 b98)
    (on b98 b196)
    (on b196 b112)
    (on b112 b62)
    (on b62 b87)
    (on b87 b84)
    (on b84 b19)
    (on b19 b130)
    (on-table b130)
    (clear b162)
    (on b162 b169)
    (on b169 b74)
    (on b74 b194)
    (on-table b194)
    (clear b40)
    (on-table b40)
    (clear b156)
    (on b156 b176)
    (on-table b176)
    (clear b131)
    (on b131 b93)
    (on-table b93)
    (clear b207)
    (on b207 b129)
    (on b129 b49)
    (on b49 b163)
    (on-table b163)
    (clear b103)
    (on b103 b54)
    (on b54 b95)
    (on b95 b148)
    (on b148 b20)
    (on b20 b134)
    (on b134 b5)
    (on-table b5)
    (clear b109)
    (on b109 b9)
    (on b9 b171)
    (on b171 b142)
    (on-table b142)
    (clear b58)
    (on b58 b12)
    (on-table b12)
    (clear b34)
    (on-table b34)
    (clear b174)
    (on-table b174)
    (clear b146)
    (on-table b146)
    (clear b113)
    (on-table b113)
    (clear b160)
    (on b160 b14)
    (on b14 b188)
    (on b188 b149)
    (on-table b149)
    (clear b97)
    (on b97 b200)
    (on b200 b143)
    (on b143 b17)
    (on b17 b153)
    (on b153 b66)
    (on b66 b155)
    (on b155 b64)
    (on-table b64)
    (clear b65)
    (on b65 b170)
    (on b170 b38)
    (on b38 b79)
    (on-table b79)
    (clear b172)
    (on b172 b4)
    (on b4 b44)
    (on b44 b138)
    (on b138 b140)
    (on b140 b99)
    (on b99 b68)
    (on b68 b88)
    (on b88 b59)
    (on b59 b18)
    (on b18 b7)
    (on b7 b150)
    (on b150 b167)
    (on b167 b57)
    (on b57 b63)
    (on-table b63)
    (clear b151)
    (on b151 b118)
    (on b118 b125)
    (on b125 b89)
    (on b89 b177)
    (on b177 b27)
    (on b27 b123)
    (on b123 b202)
    (on b202 b23)
    (on b23 b128)
    (on b128 b114)
    (on b114 b193)
    (on b193 b152)
    (on b152 b30)
    (on b30 b183)
    (on b183 b108)
    (on b108 b16)
    (on b16 b137)
    (on b137 b75)
    (on b75 b45)
    (on b45 b154)
    (on b154 b26)
    (on b26 b85)
    (on b85 b124)
    (on b124 b47)
    (on b47 b205)
    (on-table b205)
    (clear b165)
    (on-table b165)
    (clear b70)
    (on b70 b147)
    (on b147 b73)
    (on b73 b187)
    (on b187 b22)
    (on b22 b104)
    (on b104 b32)
    (on b32 b141)
    (on b141 b33)
    (on b33 b15)
    (on b15 b39)
    (on b39 b122)
    (on b122 b206)
    (on b206 b209)
    (on b209 b11)
    (on-table b11)
    (clear b111)
    (on b111 b13)
    (on b13 b115)
    (on b115 b35)
    (on b35 b46)
    (on-table b46)
    (clear b198)
    (on b198 b175)
    (on b175 b173)
    (on b173 b80)
    (on b80 b106)
    (on b106 b185)
    (on-table b185)
    (clear b166)
    (on b166 b159)
    (on b159 b189)
    (on b189 b2)
    (on b2 b199)
    (on-table b199)
    (clear b133)
    (on-table b133)
    (clear b6)
    (on b6 b91)
    (on b91 b61)
    (on b61 b136)
    (on-table b136)
    (clear b42)
    (on b42 b96)
    (on b96 b55)
    (on b55 b60)
    (on-table b60)
    (clear b190)
    (on-table b190)
    (clear b144)
    (on b144 b77)
    (on b77 b181)
    (on-table b181)
    (clear b90)
    (on-table b90)
    (clear b29)
    (on b29 b139)
    (on-table b139)
    (clear b56)
    (on-table b56))
 (:goal  (and 
    (clear b5)
    (on b5 b3)
    (on b3 b2)
    (on b2 b1)
    (on b1 b4)
    (on b4 b6)
    (on-table b6))))

; plan
1. (unstack b6 b91)
   deleted: (on b6 b91) (clear b6) (arm-empty)
   added: (holding b6) (clear b91)
   goals met: 0 of 7
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 7
3. (unstack b103 b54)
   deleted: (on b103 b54) (clear b103) (arm-empty)
   added: (holding b103) (clear b54)
   goals met: 1 of 7
4. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 1 of 7
5. (unstack b166 b159)
   deleted: (on b166 b159) (clear b166) (arm-empty)
   added: (holding b166) (clear b159)
   goals met: 1 of 7
6. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 1 of 7
7. (unstack b159 b189)
   deleted: (on b159 b189) (clear b159) (arm-empty)
   added: (holding b159) (clear b189)
   goals met: 1 of 7
8. (putdown b159)
   deleted: (holding b159)
   added: (clear b159) (arm-empty) (on-table b159)
   goals met: 1 of 7
9. (unstack b168 b1)
   deleted: (on b168 b1) (clear b168) (arm-empty)
   added: (holding b168) (clear b1)
   goals met: 1 of 7
10. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 1 of 7
11. (unstack b172 b4)
   deleted: (on b172 b4) (clear b172) (arm-empty)
   added: (holding b172) (clear b4)
   goals met: 1 of 7
12. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 1 of 7
13. (unstack b189 b2)
   deleted: (on b189 b2) (clear b189) (arm-empty)
   added: (holding b189) (clear b2)
   goals met: 1 of 7
14. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 1 of 7
15. (unstack b50 b78)
   deleted: (on b50 b78) (clear b50) (arm-empty)
   added: (holding b50) (clear b78)
   goals met: 1 of 7
16. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 1 of 7
17. (unstack b54 b95)
   deleted: (on b54 b95) (clear b54) (arm-empty)
   added: (holding b54) (clear b95)
   goals met: 1 of 7
18. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 1 of 7
19. (unstack b78 b180)
   deleted: (on b78 b180) (clear b78) (arm-empty)
   added: (holding b78) (clear b180)
   goals met: 1 of 7
20. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 1 of 7
21. (unstack b180 b41)
   deleted: (on b180 b41) (clear b180) (arm-empty)
   added: (holding b180) (clear b41)
   goals met: 1 of 7
22. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 1 of 7
23. (unstack b41 b51)
   deleted: (on b41 b51) (clear b41) (arm-empty)
   added: (holding b41) (clear b51)
   goals met: 1 of 7
24. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 1 of 7
25. (unstack b51 b195)
   deleted: (on b51 b195) (clear b51) (arm-empty)
   added: (holding b51) (clear b195)
   goals met: 1 of 7
26. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 1 of 7
27. (unstack b195 b3)
   deleted: (on b195 b3) (clear b195) (arm-empty)
   added: (holding b195) (clear b3)
   goals met: 1 of 7
28. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 1 of 7
29. (unstack b95 b148)
   deleted: (on b95 b148) (clear b95) (arm-empty)
   added: (holding b95) (clear b148)
   goals met: 1 of 7
30. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 1 of 7
31. (unstack b148 b20)
   deleted: (on b148 b20) (clear b148) (arm-empty)
   added: (holding b148) (clear b20)
   goals met: 1 of 7
32. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 1 of 7
33. (unstack b20 b134)
   deleted: (on b20 b134) (clear b20) (arm-empty)
   added: (holding b20) (clear b134)
   goals met: 1 of 7
34. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 7
35. (unstack b134 b5)
   deleted: (on b134 b5) (clear b134) (arm-empty)
   added: (holding b134) (clear b5)
   goals met: 2 of 7
36. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 2 of 7
37. (unstack b4 b44)
   deleted: (on b4 b44) (clear b4) (arm-empty)
   added: (holding b4) (clear b44)
   goals met: 2 of 7
38. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 3 of 7
39. (unstack b1 b86)
   deleted: (on b1 b86) (clear b1) (arm-empty)
   added: (holding b1) (clear b86)
   goals met: 3 of 7
40. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 4 of 7
41. (unstack b2 b199)
   deleted: (on b2 b199) (clear b2) (arm-empty)
   added: (holding b2) (clear b199)
   goals met: 4 of 7
42. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 7
43. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 5 of 7
44. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 6 of 7
45. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
46. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 7 of 7
